package Repeat.RefresherMonth;

/**
 * Задание 3: Продвинутая многопоточность (CountDownLatch или Semaphore)
 * 
 * Условие:
 * 1. У нас есть 5 спортсменов (каждый - отдельный поток).
 * 2. Они готовятся к старту и выводят "Спортсмен X готовится". 
 * 3. Подготовка занимает случайное время от 1 до 3 секунд (используй Thread.sleep).
 * 4. Главный поток ждет, пока все 5 спортсменов не будут готовы. Как только все 
 *    готовы, главный поток выводит "На старт, внимание, марш!".
 * 
 * (Подсказка: используй CountDownLatch).
 */
public class Task3_ConcurrencyUtils {
    public static void main(String[] args) {
        
    }
}

