package Repeat.RefresherMonth;

/**
 * Задание 2: Основы многопоточности (Создание потоков, join, synchronized)
 * 
 * Условие:
 * 1. Создайте переменную-счетчик (общий ресурс).
 * 2. Создайте 2 потока (например, реализовав Runnable). 
 * 3. Каждый поток должен в цикле 10 000 раз увеличивать счетчик на 1.
 * 4. Главный поток (main) должен дождаться завершения обоих потоков (используй join).
 * 5. Убедитесь, что конечный результат равен ровно 20 000. Вспомните, почему могут 
 *    происходить потери при инкременте, и используйте synchronized для решения проблемы.
 */
public class Task2_ThreadsBasic {
    public static void main(String[] args) {
        
    }
}

