package AdvancedJava.JavaCollectionsFramework.iterable;

public class Task2 {
    // Задача 2:
    // Создай обобщенный класс корзины покупок ShoppingCart<T>, реализующий интерфейс Iterable<T>.
    // Внутри корзины элементы можно хранить в любом удобном виде (массив, список и т.д.).
    // Добавь метод для помещения новых элементов в корзину.
    // Реализуй итератор, который не только умеет проходить по элементам (hasNext, next), 
    // но и корректно поддерживает метод remove(), удаляя текущий элемент из твоей коллекции.
    // В методе main добавь несколько товаров в корзину, пройдись по ним итератором и удали определенные товары с помощью iterator.remove().
    // Выведи содержимое корзины до и после удаления, чтобы убедиться в правильности работы.

    public static void main(String[] args) {
        
    }
}
